package org.cl.configuration;

public class RegexString {

	public static final String Regex_theme = "#(\\w|[\\x{4e00}-\\x{9fa5}]|[-]|[_])*#";
	public static final String Regex_at = "@(\\w|[\\x{4e00}-\\x{9fa5}]|[-]|[_])*(\\s|[:]|$)";
	public static final String Regex_url = "(http|https)://[\\w\\-_]+(\\.[\\w\\-_]+)+([\\w\\-\\.,@?^=%&amp;:/~\\+#]*[\\w\\-\\@?^=%&amp;/~\\+#])?";
	public static final String Regex_acronym = "[0-9]*[a-zA-Z]+[0-9]*[a-zA-Z]+[0-9]*";
	public static final String Regex_emoticon_official = "[\\[][[\u4E00-\u9FFF]|[a-zA-Z]]{1,8}[\\]]";
	public static final String Regex_emoticon_character = "[[\\p{P}+]|[ː¸˛˚˙ˇ˘˝´¨￣~$`^=\\|<>～｀＄＾＋＝｜＜＞￥×±÷≠≤≥∞∴♂♀ゝ∠⊥⌒∂\"∇Σ≡≒≌≦≧∽√∝∵∫∬∈∪∩∧∨￢⇒⇔∀∃∮ξζ∑∏℃ωっ□ 〓╳々ㄨヾ彡乂눈〆╭╮╰╯╱╲№㏇™℡ఠ ൠ®✧§≈卐≖Ψのㅂ㊣ミツ灬ρ≮≯∥﹤﹥じゞ☆ัლﻬ☄ஐ₪Þ௫ΩжфюЮ✙✉ಥ✌و✁❦❧❤❃❂❁❀✿ﾟ➳εїз♧●♋✈ぷ¤♩✰♥➽〠〄㍿♝♞➴➵㊚㊛㊙℗♯♪♫♬♭♮☪♈º큐©►◄☼♦◊◘◙๑ิ❊❋❄❅❇✱✲✳✾✺✹✸✶✵✷❖❥☇☈☉☊☋☌☍☑☒☢☸☹☺☻☽☾‾◡♠♡♢♣♤۩۞｡◕☀☁☂☃☄❉★இ◎◇◆■△▲▽▼◁◀▷▶⊙◈▣◐◑▒▤▥▨▧▦▩〇♨☜☞¶↕↗↙↖↘↑↓↔→←▁▂▃▄▅▆▇█〒▓⊕Θ◣◢◥◤⊿┇┅─│┌┐┘└├┬┤┴┼━┃┏┓┛┗┣┳┫┻╋┠┯┨┷┿┝┰┥┸╂┒¬┑┚┙┖┕┎┍┞┟┡┢┦┧┩┪┭┮┱┲┵┶┹┺┽┾╀╁╃╄╅╆╇╈╉╊╝╚╔╬╗═╓╩皿дДづロ▽凸目口人切拜咕囧冏莔表エェ王益艹罒ㄏㄟPqXYㄒTUZzMmvrzuOo0ー]]{2,10}";
	/*public static final String Regex_emoticon = "[\\[][[\u4E00-\u9FFF]|[a-zA-Z]]{1,8}[\\]|[[\\p{P}+]|[ː¸˛˚˙ˇ˘˝´¨￣~$`^=\\|<>～｀＄＾＋＝｜＜＞￥×±÷≠≤≥∞∴♂♀ゝ∠⊥⌒∂\"∇Σ≡≒≌≦≧∽√∝∵∫∬∈∪∩∧∨￢⇒⇔∀∃∮ξζ∑∏℃ωっ□ 〓╳々ㄨヾ彡乂눈〆╭╮╰╯╱╲№㏇™℡ఠ ൠ®✧§≈卐≖Ψのㅂ㊣ミツ灬ρ≮≯∥﹤﹥じゞ☆ัლﻬ☄ஐ₪Þ௫ΩжфюЮ✙✉ಥ✌و✁❦❧❤❃❂❁❀✿ﾟ➳εїз♧●♋✈ぷ¤♩✰♥➽〠〄㍿♝♞➴➵㊚㊛㊙℗♯♪♫♬♭♮☪♈º큐©►◄☼♦◊◘◙๑ิ❊❋❄❅❇✱✲✳✾✺✹✸✶✵✷❖❥☇☈☉☊☋☌☍☑☒☢☸☹☺☻☽☾‾◡♠♡♢♣♤۩۞｡◕☀☁☂☃☄❉★இ◎◇◆■△▲▽▼◁◀▷▶⊙◈▣◐◑▒▤▥▨▧▦▩〇♨☜☞¶↕↗↙↖↘↑↓↔→←▁▂▃▄▅▆▇█〒▓⊕Θ◣◢◥◤⊿┇┅─│┌┐┘└├┬┤┴┼━┃┏┓┛┗┣┳┫┻╋┠┯┨┷┿┝┰┥┸╂┒¬┑┚┙┖┕┎┍┞┟┡┢┦┧┩┪┭┮┱┲┵┶┹┺┽┾╀╁╃╄╅╆╇╈╉╊╝╚╔╬╗═╓╩皿дДづロ▽凸目口人切拜咕囧冏莔表エェ王益艹罒ㄏㄟPqXYㄒTUZzMmvrzuOo0ー]]{2,10}]";
	*/public static final String Regex_punt = "[[[\\p{P}+]|[$\\^=<>~+`～｀＄＾＋＝｜＜＞￥×★☆❤❥✰♥❃❂❁❀✿☀☁☂☃♂♀]]&&[^@\\[\\]]]";
	public static final String Regex_char = "[\\w|[\\x{4e00}-\\x{9fa5}]]";//匹配英文字母，大小写，_ 和数字、汉字
	/**String punt_compensatiom = "ː¸˛˚˙ˇ˘˝´¨￣~$`^=\\|<>～｀＄＾＋＝｜＜＞￥×±÷≠≤≥∞∴♂♀∠⊥⌒∂\"∇≡≒≌≦≧∽√∝∵∫∬∈∪∩∧∨￢⇒⇔∀∃∮ξζ∑∏℃ω□ 〓╳々ㄨ╭╮╰╯╱╲№㏇™℡®§≈卐の㊣ミ灬≮≯∥﹤﹥じ☆ัﻬஐ₪Þ௫ΩжфюЮ✙✉✌✁❦❧❤❃❂❁❀✿ﾟ➳εїз♧●♋✈ぷ¤♩✰♥➽〠〄㍿♝♞➴➵㊚㊛㊙℗♯♪♫♬♭♮☪♈º큐©►◄☼♦◊◘◙๑ิ❊❋❄❅❇✱✲✳✾✺✹✸✶✵✷❖❥☇☈☉☊☋☌☍☑☒☢☸☹☺☻☽☾♠♡♢♣♤۩۞｡◕☀☁☂☃☄❉★◎◇◆■△▲▽▼◁◀▷▶⊙◈▣◐◑▒▤▥▨▧▦▩〇♨☜☞¶↕↗↙↖↘↑↓↔▁▂▃▄▅▆▇█〒▓⊕Θ◣◢◥◤⊿回┇┅─│┌┐┘└├┬┤┴┼━┃┏┓┛┗┣┳┫┻╋┠┯┨┷┿┝┰┥┸╂┒¬┑┚┙┖┕┎┍┞┟┡┢┦┧┩┪┭┮┱┲┵┶┹┺┽┾╀╁╃╄╅╆╇╈╉╊╝╚╔╬╗═╓╩";
	 * String context1 ="＋－＜＝＞×     		≪≫ː¸˛˚˙ˇ˘˝´∼¨￣±÷≠≤≥∞∴♂♀∠⊥⌒∂∇≡≒≌≦≧∽√∝∵∫∬∈∪∩∧∨￢⇒⇔∀∃∮∑∏";
		String context2 = "＄％‰￥′″      	￦Ｆ℃Å￠￡¤℉ ㎕㎖㎗ℓ㎘㏄㎣㎤㎥㎦㎙㎚㎛㎜㎝㎞㎟㎠㎡㎢㏊㎍㎎㎏㏏㎈㎉㏈㎧㎨㎰㎱㎲㎳㎴㎵㎶";
		String context3 = "					㎷㎸㎹㎀㎁㎂㎃㎄㎺㎻㎼㎽㎾㎿㎐㎑㎒㎓㎔Ω㏀㏁㎊㎋㎌㏖㏅㎭㎮㎯㏛㎩㎪㎫㎬㏝㏐㏓㏃㏉㏜㏆";
		String context4 = "＃＆＊＠※→←      		 §☆★●◎◇◆□■△▲▽▼〓◁◀▷▶♤♠♡♧♣⊙◈▣◐◑▒▤▥▨▧▦▩☉●〇◎";
		String context5 = "†‡→←				♨☜☞¶↕↗↙↖↘↑↓↔↕↑↓㉿㈜№㏇™㏂㏘℡®ªºξζω□∮〓╳々∞ㄨ╭╮╰╯╱╲";
		String context6 = "﹉﹊﹍﹎‖︴﹏﹋﹌  	▁▂▃▄▅▆▇█▇▆▅▄▃▂▁〒¤★☆▓⊕Θ⊙¤★☆◣◢◥◤⊿回□┇┅";
		String context7 = "~-$*&#＊ 			≈々∞卐の℡㊣§∮ミ灬№ωㄨ≮≯∥﹤﹥じ☆□∮〓ぷ¤々ㄨ☆≠๑۩۞๑｡◕☀☁☂☃☄❉";
		String context8 = "					❊❋❄❅❇✱✲✳✾✺✹✸✶✵✷❖❥❦❧☇☈☉☊☋☌☍☑☒☢☸☹☺☻☼☽☾♠♡♢♣♤♦♧";
		String context9 = "«»•				♩✙✈✉✌✁✰❁♥ ➽〠〄㍿♝♞➴➵㊚㊛㊙℗♯♩♪♫♬♭♮☪♈º₪¤큐™©®℡►◄☼♦◊◘◙♪♫๑ิ";
		String context10 = "•¡･｡.•*.			 ัﻬஐ₪Þ௫ΩжфюЮ✙✉✌✁❦❧❤❃❂❁❀✿ﾟ➳εїз♧●♋✈";
		String context11 = "				─│┌┐┘└├┬┤┴┼━┃┏┓┛┗┣┳┫┻╋┠┯┨┷┿┝┰┥┸╂┒";
		String context12 = "				¬┑┚┙┖┕┎┍┞┟┡┢┦┧┩┪┭┮┱┲┵┶┹┺┽┾╀╁╃╄╅╆╇╈╉╊╝╚╔╬ ╗ ═ ╓ ╩";
		String context13 = "				ⓐⓑⓒⓓⓔⓕⓖⓗⓘⓙⓚⓛⓜⓝⓞⓟⓠⓡⓢⓣⓤⓥⓦⓧⓨⓩ❶❷❸❹❺❻❼❽❾❿⓪";
		String context14 = "				①②③④⑤⑥⑦⑧⑨⑩⑪⑫⑬⑭⑮⑯⑰⑱⑲⑳⑴⑵⑶⑷⑸⑹⑺⑻⑼⑽⑾⑿⒀⒁⒂";
		String context15 = "				ā á ǎ à ō ó ǒ ò ê ē é ě è ī í ǐ ì ū ú ǔ ù ǖ ǘ ǚ ǜ ü";
		String context16 = "				ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΩαβγδεζηθικλμνξοπρστυφχψω";
	 */
}
